       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLAMUNDO.

       PROCEDURE DIVISION.
           DISPLAY '¡Hola Mundo desde GnuCOBOL en Docker!'.
           STOP RUN.
           